zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_ipc_bt.c
            BTIPC_LOG_L1("HPC payload type %d\n",msgType);

            if ((contextPtr->internal_hpc_notify_cb) != NULL)
            {
                BTIPC_LOG_L1("Notify HPC int cb+\n");
                contextPtr->internal_hpc_notify_cb((void*)contextPtr, mesg);
                BTIPC_LOG_L1("Notify HPC int cb-\n");
            }
            for (idx = 0; idx < ((uint8_t)MAX_BT_IPC_HPC_CB); idx++)
            {
                BTIPC_LOG_L1("idx %d, Notify HPC cb %p, msgType %d\n",idx, contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr, contextPtr->hpcNotifyCallbackParam[idx].msgType);
                if ((contextPtr->hpcNotifyCallbackParam[idx].msgType == msgType) &&
                    (contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr != NULL))
                {
                   BTIPC_LOG_L1("Calling Notify HPC cb %p\n",contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr);
                    if ((msgType == CY_BT_IPC_HPC_LONG) && (*(((uint8_t*)mesg)+1) == (uint8_t)CY_BT_IPC_HPC_INIT))
                    {
                        /* Add Boot type to the message add pass it to the application */
                        *(((uint8_t*)mesg)+2) = contextPtr->bootType;
                        /* Certificate error field, so that the app can process if needed */
                        mesg[1] = contextPtr->certError;
                    }
                    contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr(mesg);
                }
            }
            /* Release channel for HPC message only */
            (void)Cy_BTIPC_HPC_RelChannel(contextPtr, backup); /* Suppress a compiler warning about unused return value */
#ifdef CY_BTIPC_STATS
            contextPtr->ipc_hpc_peer_release_count++;
#endif
            if (0xFFUL == (0xFFUL & mesg[0]))
            {

                    (void)Cy_BTIPC_HPC_RelBuffer(contextPtr, backup); /* Suppress a compiler warning about unused return value */

            }
            /*At boot config wait BT FW does not process HPC release buffer and hence fails to release IPC channel.
            Since we want to lock PDCM at IPC write and release only after BT does IPC CH release, we need a count reset
            to avoid PDCM use count mismatch, which will prevent BT from doing a DS*/
            if((cy_en_btipc_boottype_t)contextPtr->bootType == CY_BT_IPC_BOOT_FULLY_UP)
            {
                Cy_BTSS_PowerDepResetCount();
            }
        }

        if ((notify & (uint32_t)(0x1UL << contextPtr->dlChannelHCI)) != 0UL)
        {
#ifdef CY_BTIPC_STATS
            contextPtr->ipc_hci_notify_count++;
#endif
            channelHCI = contextPtr->dlChannelHCI;

            BTIPC_LOG_L1("on ch %ld\n",channelHCI);

            ipcPtr = Cy_IPC_Drv_GetIpcBaseAddress(channelHCI);
            Cy_IPC_Drv_ReadDDataValue(ipcPtr, mesg);
            /* Push the mesg to FIFO */
            if (((uint32_t)Cy_BTIPC_HCI_FIFOPut(contextPtr, mesg)) == 0UL)
            {
                if (((uint16_t)MAX_IPC_FIFO_SIZE) > Cy_BTIPC_HCI_FIFOCount(contextPtr))
                {
                    /* Release channel for HCI message only if FIFO is not full */
                    (void)Cy_BTIPC_HCI_RelChannel(contextPtr); /* Suppress a compiler warning about unused return value */
#ifdef CY_BTIPC_STATS
                    contextPtr->ipc_hci_peer_release_count++;
#endif
                }
                else
                {
                    contextPtr->ipc_hci_fifo_full++;
                    BTIPC_LOG_L0("\nFIFO is Full. Ch 0x%lx not released !\n",channelHCI);
                }
                BTIPC_LOG_L1("FIFO count %d\n",contextPtr->IpcFifo.bufLen);

                /* call the callback function */
                if ((contextPtr->dlNotifyCallbackPtr) != NULL)
                {

                    BTIPC_LOG_L1("Notify HCI cb\n");
                    contextPtr->dlNotifyCallbackPtr(mesg);
                }
            }
            else
            {
                BTIPC_LOG_L0("Error: Msg received after FIFO is full !\n");
                contextPtr->droppedHCI++;
                /* Add assert here */
                CY_ASSERT_L1(false);
                return;
            }
        }
    }
}
CY_IPC_SECTION_END

CY_IPC_SECTION_BEGIN
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_RelChannel(cy_stc_ipc_bt_context_t *btIpcContext)
{
    IPC_STRUCT_Type *ipcPtr;
    uint32_t rel_mask;
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;

    if (NULL == contextPtr)
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    ipcPtr = Cy_IPC_Drv_GetIpcBaseAddress (contextPtr->dlChannelHCI);

    rel_mask = (uint32_t)(1UL << contextPtr->intStucturePeer);

    Cy_IPC_Drv_ReleaseNotify(ipcPtr, rel_mask);

    return CY_BT_IPC_DRV_SUCCESS;
}
CY_IPC_SECTION_END


cy_en_btipcdrv_status_t Cy_BTIPC_HPC_RelChannel(cy_stc_ipc_bt_context_t *btIpcContext, void * buf)
{
    IPC_STRUCT_Type *ipcPtr;
    uint32_t rel_mask;
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    (void)buf;
    // Fix if this is causing issue
#if 1
    if ((NULL == contextPtr) || (NULL == buf))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }
#endif

    ipcPtr = Cy_IPC_Drv_GetIpcBaseAddress (contextPtr->dlChannelHPC);

    rel_mask = (uint32_t)(1UL << contextPtr->intStucturePeer);
    BTIPC_LOG_L1("Release %p, mask 0x%lx\n", ipcPtr, rel_mask);
    Cy_IPC_Drv_ReleaseNotify(ipcPtr, rel_mask);
    BTIPC_LOG_L1("Release register 0x%lx\n", ipcPtr->RELEASE);
    return CY_BT_IPC_DRV_SUCCESS;
}


cy_en_btipcdrv_status_t Cy_BTIPC_HCI_RelBuffer(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t* msgPtr)
{
    cy_stc_ipc_msg_alloc_t ipcMsgAlloc;
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint8_t idx;
    uint8_t found;
    uint32_t interruptState;
    uint32_t *pMsg;

    if ((NULL == contextPtr) || (NULL == msgPtr))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    if (((cy_stc_ipc_msg_buff_t*)((void*)msgPtr))->pti != ((uint8_t)CY_BT_IPC_HCI_LONG))
    {
        /* Remove the FIFO entry */
        (void)Cy_BTIPC_HCI_FIFOGet(contextPtr, &pMsg, 1);
        return CY_BT_IPC_DRV_SUCCESS;
    }

    found = 0;

