zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_ipc_bt.c
    interruptState = Cy_SysLib_EnterCriticalSection();

    /* If the channel is busy then do not proceed further, return CH BUSY error */
    if (Cy_IPC_Drv_IsLockAcquired (Cy_IPC_Drv_GetIpcBaseAddress(contextPtr->ulChannelHPC)))
    {
        Cy_SysLib_ExitCriticalSection(interruptState);
        return CY_BT_IPC_DRV_ERROR_CH_BUSY;
    }

    for (idx = 0U; idx < ((uint8_t)MAX_TO_FREE_BUF_COUNT); idx++)
    {
        if (contextPtr->toFreeBuf[idx].bufPtr == (uint8_t*)msgPtr[1])
        {
            ipcMsgAlloc.pti = (uint8_t)CY_BT_IPC_HPC_BUFRELEASE;
            ipcMsgAlloc.bufType = ((uint8_t)contextPtr->toFreeBuf[idx].bufType);
            ipcMsgAlloc.bufSize = contextPtr->toFreeBuf[idx].bufLen;
            ipcMsgAlloc.bufAddr = contextPtr->toFreeBuf[idx].bufPtr;
            found = 1;
            contextPtr->toFreeBuf[idx].bufType = CY_BT_IPC_HCI_INVALID_BUF;
            contextPtr->toFreeBuf[idx].bufLen = 0;
            contextPtr->toFreeBuf[idx].bufPtr = NULL;
            break;
        }
    }

    Cy_SysLib_ExitCriticalSection(interruptState);

    /* Remove the FIFO entry */
    (void)Cy_BTIPC_HCI_FIFOGet(contextPtr, &pMsg, 1);

    if (found != 0UL)
    {
#ifdef CY_BTIPC_STATS
        contextPtr->ipc_hci_peer_outbuf_count++;
#endif
        return (Cy_BTIPC_HPC_Write(contextPtr, &ipcMsgAlloc, (size_t) 2));
    }
    else
    {
        return CY_BT_IPC_DRV_ERROR_BUF_GET;
    }
}


cy_en_btipcdrv_status_t Cy_BTIPC_HPC_RelBuffer(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t* msgPtr)
{
    cy_stc_ipc_msg_alloc_t ipcMsgAlloc;
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;

    if ((NULL == contextPtr) || (NULL == msgPtr))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    BTIPC_LOG_L1("Releasing HPC buffer 0x%lx\n", msgPtr[1]);
#ifdef CY_BTIPC_STATS
    contextPtr->ipc_hpc_peer_outbuf_count++;
#endif
    ipcMsgAlloc.pti = (uint8_t)CY_BT_IPC_HPC_BUFRELEASE;
    ipcMsgAlloc.bufType = 0;
    ipcMsgAlloc.bufSize = 0;
    ipcMsgAlloc.bufAddr = (uint8_t*)msgPtr[1];

    return (Cy_BTIPC_HPC_Write(contextPtr, &ipcMsgAlloc, (size_t) 2));
}


void Cy_BTIPC_HPC_Notify(void *btIpcContext, uint32_t * msgPtr)
{
    cy_en_btipc_hpcpti_t pti;
    cy_stc_ipc_bt_context_t *contextPtr = (cy_stc_ipc_bt_context_t*) btIpcContext;
    if ((NULL == contextPtr) || (NULL == msgPtr))
    {
        return;
    }

    BTIPC_LOG_L1("Internal cb for HPC\n");

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_btipc_hpcpti_t enum.');
    pti = (cy_en_btipc_hpcpti_t)((0xFFUL) & msgPtr[0]);

    switch (pti)
    {
        case CY_BT_IPC_HPC_LONG:
            (void)Cy_bt_handle_hpclong_msg(contextPtr, msgPtr);
            break;
        case CY_BT_IPC_HPC_BUFPROVIDE:
            (void)Cy_bt_handle_buf_add(contextPtr, msgPtr);
            break;
        case CY_BT_IPC_HPC_BUFFER_REMOVE:
            (void)Cy_bt_handle_buf_remove(contextPtr, msgPtr);
            break;
        default:
            /* default invalid pti */
            break;
    }
}


cy_en_btipcdrv_status_t Cy_BTIPC_Init(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_bt_config_t *btIpcConfig)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    cy_en_btipcdrv_status_t status;
    uint8_t idx;

    if ((NULL == contextPtr) || (NULL == btIpcConfig))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    contextPtr->dlChannelHCI = btIpcConfig->dlChannelHCI;
    contextPtr->ulChannelHCI = btIpcConfig->ulChannelHCI;

    contextPtr->dlChannelHPC = btIpcConfig->dlChannelHPC;
    contextPtr->ulChannelHPC = btIpcConfig->ulChannelHPC;

    contextPtr->intStuctureSelf = btIpcConfig->intStuctureSelf;
    contextPtr->intStucturePeer = btIpcConfig->intStucturePeer;
    contextPtr->intPeerMask = (uint32_t) (0x1UL << btIpcConfig->intStucturePeer);

    contextPtr->dlNotifyCallbackPtr = NULL;
    contextPtr->ulReleaseCallbackPtr = btIpcConfig->ulReleaseCallbackPtr;
    contextPtr->bufCallbackPtr = btIpcConfig->bufCallbackPtr;

    contextPtr->irqHandlerPtr = btIpcConfig->irqHandlerPtr;
    contextPtr->ipcIntConfig.intrSrc = btIpcConfig->ipcIntConfig.intrSrc;
    contextPtr->ipcIntConfig.intrPriority = btIpcConfig->ipcIntConfig.intrPriority;

    contextPtr->internal_hpc_notify_cb = btIpcConfig->internal_hpc_notify_cb;

    contextPtr->dlNotifyMask = (uint32_t)((uint32_t)(0x1UL << btIpcConfig->dlChannelHCI) | (uint32_t)(0x1UL << btIpcConfig->dlChannelHPC));
    contextPtr->ulReleaseMask = (uint32_t)((uint32_t)(0x1UL << btIpcConfig->ulChannelHCI) | (uint32_t)(0x1UL << btIpcConfig->ulChannelHPC));

    contextPtr->droppedHCI = 0;

    contextPtr->bootType = 0xFF;

    for (idx = 0U; idx <((uint8_t)MAX_BT_IPC_HPC_CB); idx++)
    {
        contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr = NULL;
        contextPtr->hpcNotifyCallbackParam[idx].msgType = CY_BT_IPC_HPC_RESERVED;
    }

    for (idx = 0U; idx < ((uint8_t)MAX_BUF_COUNT); idx++)
    {
        contextPtr->buffPool[idx].bufPtr = NULL;
        contextPtr->buffPool[idx].bufType = CY_BT_IPC_HCI_INVALID_BUF;
    }

    for (idx = 0U; idx < ((uint8_t)MAX_IPC_FIFO_SIZE); idx++)
    {
        contextPtr->IpcFifo.fifo[idx].msg[0] = 0;
        contextPtr->IpcFifo.fifo[idx].msg[1] = 0;
    }
    contextPtr->IpcFifo.rdIdx = 0;
    contextPtr->IpcFifo.wrIdx = 0;
    contextPtr->IpcFifo.bufLen = 0;

    for (idx = 0U; idx < ((uint8_t)MAX_TO_FREE_BUF_COUNT); idx++)
    {
        contextPtr->toFreeBuf[idx].bufPtr = NULL;
        contextPtr->toFreeBuf[idx].bufType = CY_BT_IPC_HCI_INVALID_BUF;
        contextPtr->toFreeBuf[idx].bufLen = 0;
    }

    status = Cy_BTIPC_WarmInit(contextPtr, btIpcConfig);

#ifdef CY_BTIPC_STATS
    contextPtr->ipc_int_count = 0;

    contextPtr->ipc_hci_cmd_count = 0;
    contextPtr->ipc_hpc_cmd_count = 0;

    contextPtr->ipc_hci_release_count = 0;
    contextPtr->ipc_hpc_release_count = 0;

    contextPtr->ipc_hci_notify_count = 0;
    contextPtr->ipc_hpc_notify_count = 0;

    contextPtr->ipc_hci_peer_release_count = 0;
    contextPtr->ipc_hpc_peer_release_count = 0;

    contextPtr->ipc_hci_peer_inbuf_count = 0;
    contextPtr->ipc_hci_peer_outbuf_count = 0;

    contextPtr->ipc_hpc_peer_inbuf_count = 0;
    contextPtr->ipc_hpc_peer_outbuf_count = 0;

    contextPtr->ipc_hci_cmd_self_outbuf_count = 0;
    contextPtr->ipc_hci_cmd_self_inbuf_count = 0;
    contextPtr->ipc_hci_cmd_self_outbuf_success = 0;

    contextPtr->ipc_hci_fifo_full = 0;
    contextPtr->ipc_hci_notify_in_fifo_full = 0;
#endif
    return status;
 }


cy_en_btipcdrv_status_t Cy_BTIPC_WarmInit(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_bt_config_t *btIpcConfig)
{
    cy_en_sysint_status_t intrStatus;
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;

    if ((NULL == contextPtr) || (NULL == btIpcConfig))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    intrStatus = Cy_SysInt_Init(&contextPtr->ipcIntConfig, contextPtr->irqHandlerPtr);
    if (((uint32_t)intrStatus) != 0UL)
    {
        return CY_BT_IPC_DRV_ERROR;
    }

    /* enable interrupt */
    NVIC_EnableIRQ(contextPtr->ipcIntConfig.intrSrc);

    /* Set IPC Interrupt mask */
    /* Allow only notify on DL channel  and release on UL channel interrupts */
    Cy_IPC_Drv_SetInterruptMask(Cy_IPC_Drv_GetIntrBaseAddr(contextPtr->intStuctureSelf), contextPtr->ulReleaseMask, contextPtr->dlNotifyMask);
    return CY_BT_IPC_DRV_SUCCESS;
 }


cy_en_btipcdrv_status_t Cy_BTIPC_Deinit(cy_stc_ipc_bt_context_t *btIpcContext)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint8_t idx;

    if (NULL == contextPtr)
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    /* enable interrupt */
    NVIC_DisableIRQ(contextPtr->ipcIntConfig.intrSrc);

    contextPtr->irqHandlerPtr = NULL;
    contextPtr->internal_hpc_notify_cb = NULL;

    for (idx = 0; idx < ((uint8_t)MAX_BT_IPC_HPC_CB); idx++)
    {
        contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr = NULL;
        contextPtr->hpcNotifyCallbackParam[idx].msgType = CY_BT_IPC_HPC_RESERVED;
    }

