zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_ipc_bt.c
    for (idx = 0U; idx < ((uint8_t)MAX_BUF_COUNT); idx++)
    {
        contextPtr->buffPool[idx].bufPtr = NULL;
        contextPtr->buffPool[idx].bufType = CY_BT_IPC_HCI_INVALID_BUF;
    }

    return CY_BT_IPC_DRV_SUCCESS;
}


CY_IPC_SECTION_BEGIN
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_getPTI (cy_en_btipc_hcipti_t *pti, uint32_t *p_length, uint32_t *msgPtr)
{
    cy_stc_ipc_msg_buff_t *ipcMsgBuf;
    uint8_t *bufAddr;
    cy_en_btipc_hcipti_t mesgPti;

    if ((NULL == pti) || (NULL == msgPtr) || (NULL == p_length))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    /* Incase of long messages the PTI needs to be read from DATA0[bit 8-15] */
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_btipc_hcipti_t enum');
    mesgPti = (cy_en_btipc_hcipti_t)((0xFFUL) & msgPtr[0]);
    if (mesgPti == CY_BT_IPC_HCI_LONG)
    {
        ipcMsgBuf = (cy_stc_ipc_msg_buff_t*)((void*)msgPtr);
        *pti = (cy_en_btipc_hcipti_t)ipcMsgBuf->actualPti;
        bufAddr = ipcMsgBuf->bufAddr;
        /* Mapping of BT address space to MCU address space */
#if defined(BT_IPC_SIM) || !defined (BTSS)
        bufAddr = (uint8_t*)bufAddr;
#else
        bufAddr = (uint8_t*)((uint32_t)(bufAddr) + ((uint32_t)BTSS_DATA_RAM_IPC - 0x28000000UL));
#endif

        if (Cy_bt_isOffsetNeeded(*pti))
        {
            bufAddr++;
        }
    }
    else
    {
        *pti = mesgPti;
        bufAddr = (uint8_t*)msgPtr;
        /* Skip the PTI byte read from the DATA0 register */
        bufAddr++;
    }
    *p_length = Cy_bt_getPLLegnth(*pti, bufAddr);
    return CY_BT_IPC_DRV_SUCCESS;
}
CY_IPC_SECTION_END

CY_IPC_SECTION_BEGIN
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_GetReadBufPtr (cy_stc_ipc_bt_context_t *btIpcContext, void **ppData, size_t* pLength)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    cy_stc_ipc_msg_buff_t *ipcMsgBuf;
    cy_stc_ipc_msg_short_t *shortMesg;
    cy_en_btipc_hcipti_t actualPti;
    cy_en_btipc_hcipti_t mesgPti;
    cy_en_btipcdrv_status_t status;
    uint32_t *pMsg;
    uint8_t *srcPtr;
    uint8_t idx;
    uint8_t done;
    uint32_t interruptState;

    if ((NULL == contextPtr) || (NULL == ppData))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    status = Cy_BTIPC_HCI_FIFOGet(contextPtr, &pMsg, 0);

    if (((uint32_t)status) != 0UL)
    {
        return status;
    }

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_btipc_hcipti_t enum.');
    mesgPti = (cy_en_btipc_hcipti_t)((0xFFUL) & pMsg[0]);

    if (mesgPti == CY_BT_IPC_HCI_LONG)
    {
        ipcMsgBuf = (cy_stc_ipc_msg_buff_t*)((void*)pMsg);
        actualPti = (cy_en_btipc_hcipti_t)ipcMsgBuf->actualPti;
        srcPtr = ipcMsgBuf->bufAddr;
        /* Mapping of BT address space to MCU address space */
#if defined(BT_IPC_SIM) || !defined (BTSS)
        srcPtr = (uint8_t*)(srcPtr);
#else
        srcPtr = (uint8_t*)((uint32_t)(srcPtr) + ((uint32_t)BTSS_DATA_RAM_IPC - 0x28000000UL));
#endif
#ifdef CY_BTIPC_STATS
        contextPtr->ipc_hci_peer_inbuf_count++;
#endif
        if (Cy_bt_isOffsetNeeded(actualPti))
        {
            srcPtr++;
        }
        *pLength = Cy_bt_getPLLegnth(actualPti, srcPtr);

        interruptState = Cy_SysLib_EnterCriticalSection();

        done = 0;
        for (idx = 0U; idx < ((uint8_t)MAX_TO_FREE_BUF_COUNT); idx++)
        {
            if (contextPtr->toFreeBuf[idx].bufPtr == NULL)
            {
                contextPtr->toFreeBuf[idx].bufType = Cy_bt_get_buf_type(actualPti);
                contextPtr->toFreeBuf[idx].bufLen = (uint16_t)(*pLength);
                contextPtr->toFreeBuf[idx].bufPtr = ipcMsgBuf->bufAddr;
                done = 1;
                break;
            }
        }

        Cy_SysLib_ExitCriticalSection(interruptState);

        if (done == 0U)
        {
            return CY_BT_IPC_DRV_ERROR_BUF_FULL;
        }

    }
    else
    {
        shortMesg = (cy_stc_ipc_msg_short_t*)((void*)pMsg);
        srcPtr = &(shortMesg->db0);
        *pLength = Cy_bt_getPLLegnth(mesgPti, srcPtr);
    }

    *ppData = srcPtr;
    return CY_BT_IPC_DRV_SUCCESS;
}
CY_IPC_SECTION_END

CY_IPC_SECTION_BEGIN
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_GetWriteBufPtr(cy_stc_ipc_bt_context_t *btIpcContext, cy_en_btipc_hcipti_t pti, void **ppData, size_t length)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    cy_en_btipcdrv_status_t status;
    uint8_t *destBuf;
    cy_en_btipc_buftype_t bufType;
    uint8_t *bPtr;
    uint32_t interruptState;

    if ((NULL == contextPtr) || (NULL == ppData))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    interruptState = Cy_SysLib_EnterCriticalSection();
    /* If the HCI channel is busy then do not proceed further, return CH BUSY error */
    if (Cy_IPC_Drv_IsLockAcquired (Cy_IPC_Drv_GetIpcBaseAddress(contextPtr->ulChannelHCI)))
    {
        Cy_SysLib_ExitCriticalSection(interruptState);
        return CY_BT_IPC_DRV_ERROR_CH_BUSY;
    }
    Cy_SysLib_ExitCriticalSection(interruptState);

    *ppData = NULL;

    /* Get the buffer type based on the payload type indicator */
    bufType = Cy_bt_get_buf_type(pti);
    /* Pick a free buffer from the pool of buffers */
    status = Cy_bt_GetBuffer (contextPtr, (void **)&destBuf, bufType, length);
    if (((uint32_t)status) != 0UL)
    {
        return status;
    }

    bPtr = destBuf;
    /* Skip pad byte if needed */
    if (Cy_bt_isOffsetNeeded(pti))
    {
        bPtr++;
    }
    *ppData = bPtr;
    return CY_BT_IPC_DRV_SUCCESS;
}
CY_IPC_SECTION_END

CY_IPC_SECTION_BEGIN
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_Write(cy_stc_ipc_bt_context_t *btIpcContext, cy_en_btipc_hcipti_t pti, void *data, size_t length)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    cy_stc_ipc_msg_buff_t ipcPacket;
    cy_stc_ipc_msg_short_t ipcShort;
    uint32_t *msgPtr;
    uint8_t *bPtr, *bDptr;
    uint8_t i;

    if ((NULL == contextPtr) || (NULL == data))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

