zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_ipc_bt.c
    /* Check if it is long message or ACL or ISO packet.
     * As per BT FW team's request, this deviation is taken to use buffers for
     * ACL and ISO short packets. Ref JIRA DRIVERS-6513 for more details */
    if ((length > ((uint8_t)MAX_SHORT_MESG_LENGTH)) || (pti == CY_BT_IPC_HCI_ACL)
        || (pti == CY_BT_IPC_HCI_ISO))
    {
        /* Add pad byte if needed */
        bPtr = (uint8_t*)data;
        if (Cy_bt_isOffsetNeeded(pti))
        {
            bPtr--;
        }

        ipcPacket.pti = (uint8_t) CY_BT_IPC_HCI_LONG;
        ipcPacket.actualPti = (uint8_t)pti;
        ipcPacket.bufSize = 0;
        // Remap the address to BT memory map
#if defined(BT_IPC_SIM) || !defined (BTSS)
        ipcPacket.bufAddr = bPtr;
#else
        ipcPacket.bufAddr = (uint8_t*)((uint32_t)bPtr - ((uint32_t)BTSS_DATA_RAM_IPC - 0x28000000UL));
#endif
        /* end of buffer preparation */
        msgPtr = (uint32_t*)((void*)&ipcPacket);
    }
    else /* Short Message */
    {
        msgPtr = (uint32_t*)((void*)&ipcShort);
        msgPtr[0] = 0;
        msgPtr[1] = 0;
        ipcShort.pti = (uint8_t)pti;
        bPtr = &(ipcShort.db0);
        bDptr = (uint8_t*)data;

        for (i = 0; i < length; i++)
        {
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 18.1','Checked manually, these pointer will not exceed register range.');
            *bPtr++ = *bDptr++;
        }
    }

    if (Cy_IPC_Drv_SendMsgDWord(Cy_IPC_Drv_GetIpcBaseAddress(contextPtr->ulChannelHCI),
                                contextPtr->intPeerMask, msgPtr) == CY_IPC_DRV_SUCCESS)
    {
#ifdef CY_BTIPC_STATS
        contextPtr->ipc_hci_cmd_count++;
#endif
        (void)Cy_BTSS_PowerDep(true);

        return CY_BT_IPC_DRV_SUCCESS;
    }
    else
    {
        (void)ipcShort.pti; /* Suppress a compiler warning about unused variables */
        return CY_BT_IPC_DRV_ERROR_LOCK_ACQUIRE;
    }
}
CY_IPC_SECTION_END

cy_en_btipcdrv_status_t Cy_BTIPC_HPC_GetWriteBufPtr(cy_stc_ipc_bt_context_t *btIpcContext, void **ppData, size_t length)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    cy_en_btipcdrv_status_t status;
    uint8_t *destBuf;
    (void)length;
    uint32_t interruptState;

    if ((NULL == contextPtr) || (NULL == ppData))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    interruptState = Cy_SysLib_EnterCriticalSection();
    /* If the HPC channel is busy then do not proceed further, return CH BUSY error */
    if (Cy_IPC_Drv_IsLockAcquired (Cy_IPC_Drv_GetIpcBaseAddress(contextPtr->ulChannelHPC)))
    {
        Cy_SysLib_ExitCriticalSection(interruptState);
        return CY_BT_IPC_DRV_ERROR_CH_BUSY;
    }
    Cy_SysLib_ExitCriticalSection(interruptState);

    *ppData = NULL;
    /* Pick a free control buffer from the pool of buffers */
    status = Cy_bt_GetBuffer (contextPtr, (void **)&destBuf, CY_BT_IPC_CTRL_BUF, length);
    if (((uint32_t)status) == 0UL)
    {
        *ppData = destBuf;
    }
    (void) length; /* Suppress a compiler warning about unused variables */
    return status;
}


cy_en_btipcdrv_status_t Cy_BTIPC_HPC_Write(cy_stc_ipc_bt_context_t *btIpcContext, void *data, size_t length)
{
    uint32_t *dataPtr = (uint32_t*) data;
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;

    (void) length;

    if ((NULL == contextPtr) || (NULL == data))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    if (!((bool)(Cy_IPC_Drv_SendMsgDWord(Cy_IPC_Drv_GetIpcBaseAddress(contextPtr->ulChannelHPC),
                                contextPtr->intPeerMask, (uint32_t*) dataPtr))))
    {
#ifdef CY_BTIPC_STATS
        contextPtr->ipc_hpc_cmd_count++;
#endif
        (void)Cy_BTSS_PowerDep(true);

        return CY_BT_IPC_DRV_SUCCESS;
    }
    else
    {
        return CY_BT_IPC_DRV_ERROR_LOCK_ACQUIRE;
    }
}


cy_en_btipcdrv_status_t Cy_BTIPC_HCI_RegisterCb(cy_stc_ipc_bt_context_t *btIpcContext, cy_ipc_bt_callback_ptr_t hciNotifyCallbackPtr)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;

    if ((NULL == contextPtr) || (NULL == hciNotifyCallbackPtr))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    contextPtr->dlNotifyCallbackPtr = hciNotifyCallbackPtr;
    return CY_BT_IPC_DRV_SUCCESS;
}


cy_en_btipcdrv_status_t Cy_BTIPC_HCI_UnregisterCb(cy_stc_ipc_bt_context_t *btIpcContext)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;

    if (NULL == contextPtr)
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    contextPtr->dlNotifyCallbackPtr = NULL;

    return CY_BT_IPC_DRV_SUCCESS;
}


cy_en_btipcdrv_status_t Cy_BTIPC_HPC_RegisterCb(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_hcp_cb_t *pHpcNotifyCallbackParam)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint8_t idx;
    uint8_t placed;

    if ((NULL == contextPtr) || (NULL == pHpcNotifyCallbackParam))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    placed = 0U;
    for (idx = 0U; idx < ((uint8_t)MAX_BT_IPC_HPC_CB); idx++)
    {
        if ((contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr == NULL) &&
            (contextPtr->hpcNotifyCallbackParam[idx].msgType == CY_BT_IPC_HPC_RESERVED))
        {
            contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr = pHpcNotifyCallbackParam->hpcNotifyCallbackPtr;
            contextPtr->hpcNotifyCallbackParam[idx].msgType = pHpcNotifyCallbackParam->msgType;
            placed = 1;
            break;
        }
    }

    if (placed != 0U)
    {
        return CY_BT_IPC_DRV_SUCCESS;
    }
    else
    {
        return CY_BT_IPC_DRV_ERROR;
    }
}


cy_en_btipcdrv_status_t Cy_BTIPC_HPC_UnregisterCb(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_hcp_cb_t *pHpcNotifyCallbackParam)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint8_t idx;
    uint8_t found;

    if ((NULL == contextPtr) || (NULL == pHpcNotifyCallbackParam))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    found = 0;
    for (idx = 0U; idx < ((uint8_t)MAX_BT_IPC_HPC_CB); idx++)
    {
        if ((contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr == pHpcNotifyCallbackParam->hpcNotifyCallbackPtr) &&
            (contextPtr->hpcNotifyCallbackParam[idx].msgType == pHpcNotifyCallbackParam->msgType))
        {
            contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr = NULL;
            contextPtr->hpcNotifyCallbackParam[idx].msgType = CY_BT_IPC_HPC_RESERVED;
            found = 1;
            break;
        }
    }

    if (found != 0UL)
    {
        return CY_BT_IPC_DRV_SUCCESS;
    }
    else
    {
        return CY_BT_IPC_DRV_ERROR;
    }
}


