zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_ipc_bt.c
cy_en_btipcdrv_status_t Cy_BTIPC_Buffer_RegisterCb(cy_stc_ipc_bt_context_t *btIpcContext, cy_ipc_bt_bufcallback_ptr_t bufCallbackPtr)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint32_t interruptState;

    if ((NULL == contextPtr) || (NULL == bufCallbackPtr))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    interruptState = Cy_SysLib_EnterCriticalSection();
    contextPtr->bufCallbackPtr = bufCallbackPtr;
    Cy_SysLib_ExitCriticalSection(interruptState);

    return CY_BT_IPC_DRV_SUCCESS;
}


CY_IPC_SECTION_BEGIN
static cy_en_btipcdrv_status_t Cy_bt_GetBuffer (cy_stc_ipc_bt_context_t *btIpcContext, void **ppBuf, cy_en_btipc_buftype_t bufType, size_t length)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint8_t idx;
    uint8_t found;
    uint8_t size_error;
    uint32_t interruptState;

    if ((NULL == contextPtr) || (NULL == ppBuf))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    interruptState = Cy_SysLib_EnterCriticalSection();

    found = 0;
    size_error = 0;

    BTIPC_LOG_L2("Buf req: Type 0x%x, Size %d\n",bufType,length);
    BTIPC_LOG_L2("Buf Pool content\n");

#ifdef CY_BTIPC_STATS
    if (bufType == CY_BT_IPC_HCI_CMD_BUF)
    {
        contextPtr->ipc_hci_cmd_self_outbuf_count++;
    }
#endif
    for (idx = 0U; idx < ((uint8_t)MAX_BUF_COUNT); idx++)
    {
        BTIPC_LOG_L2("idx %d, bufType 0x%x, bufLen %d, bufPtr %p\n",idx, contextPtr->buffPool[idx].bufType,contextPtr->buffPool[idx].bufLen, contextPtr->buffPool[idx].bufPtr);

        if ((contextPtr->buffPool[idx].bufType == bufType) && (contextPtr->buffPool[idx].bufPtr != NULL))
        {
            if (length <= contextPtr->buffPool[idx].bufLen)
            {
                *ppBuf = (void*)contextPtr->buffPool[idx].bufPtr;
                // Mapping of address
#if defined(BT_IPC_SIM) || !defined (BTSS)
                *ppBuf = (void*)(*ppBuf);
#else
                *ppBuf = (void*)((uint32_t)(*ppBuf) + ((uint32_t)BTSS_DATA_RAM_IPC - 0x28000000UL));
#endif
                contextPtr->buffPool[idx].bufPtr = NULL;
                contextPtr->buffPool[idx].bufType = CY_BT_IPC_HCI_INVALID_BUF;
                found = 1;
#ifdef CY_BTIPC_STATS
                if (bufType == CY_BT_IPC_HCI_CMD_BUF)
                {
                   contextPtr->ipc_hci_cmd_self_outbuf_success++;
                }
#endif
                break;
            }
            else
            {
                size_error = 1;
            }
        }
    }

    Cy_SysLib_ExitCriticalSection(interruptState);

    if (found != 0UL)
    {
        return CY_BT_IPC_DRV_SUCCESS;
    }
    else if (size_error == 1UL)
    {
        return CY_BT_IPC_DRV_ERROR_BUF_SIZE;
    }
    else
    {
        *ppBuf = NULL;
        return CY_BT_IPC_DRV_ERROR_BUF_GET;
    }

}
CY_IPC_SECTION_END

static cy_en_btipcdrv_status_t Cy_bt_PutBuffer(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_bt_buf_t *bufDecriptor)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint8_t idx;
    uint32_t interruptState;
    cy_en_btipcdrv_status_t status = CY_BT_IPC_DRV_ERROR_BUF_FULL;

    BTIPC_LOG_L2("Put buffer+\n");

    if ((NULL == contextPtr) || (NULL == bufDecriptor) || (bufDecriptor->bufPtr == NULL))
    {
        BTIPC_LOG_L2("Put buffer-\n");
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    interruptState = Cy_SysLib_EnterCriticalSection();

    for (idx = 0U; idx < ((uint8_t)MAX_BUF_COUNT); idx++)
    {
        if ((contextPtr->buffPool[idx].bufType == bufDecriptor->bufType) &&
            (contextPtr->buffPool[idx].bufPtr == bufDecriptor->bufPtr))
        {
            BTIPC_LOG_L2("Buffer already present in the pool at %d\n",idx);
            status = CY_BT_IPC_DRV_ERROR_BUF_PRESENT;
            break;
        }
        else if (contextPtr->buffPool[idx].bufType == CY_BT_IPC_HCI_INVALID_BUF)
        {
            contextPtr->buffPool[idx] = *bufDecriptor;
            status = CY_BT_IPC_DRV_SUCCESS;
            BTIPC_LOG_L2("Added buffer at index %d\n",idx);
            break;
        }
        else
        {
            /* This is just to keep coverity happy */
        }
    }

    Cy_SysLib_ExitCriticalSection(interruptState);

    /* Call handler for buffer */
    if ((status == CY_BT_IPC_DRV_SUCCESS) && (NULL != contextPtr->bufCallbackPtr))
    {
        contextPtr->bufCallbackPtr(bufDecriptor->bufType);
    }

    BTIPC_LOG_L2("Put buffer-\n");
    return status;
}

static cy_en_btipcdrv_status_t Cy_bt_RemoveBuffer(cy_stc_ipc_bt_context_t *btIpcContext, cy_en_btipc_buftype_t buftype)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint8_t idx;
    uint32_t interruptState;
    cy_en_btipcdrv_status_t status = CY_BT_IPC_DRV_ERROR_BUF_GET;

    BTIPC_LOG_L2("Remove buffer+\n");

    if ((NULL == contextPtr))
    {
        BTIPC_LOG_L2("Remove buffer-\n");
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    interruptState = Cy_SysLib_EnterCriticalSection();

    for (idx = 0U; idx < ((uint8_t)MAX_BUF_COUNT); idx++)
    {
        if (contextPtr->buffPool[idx].bufType == buftype)
        {
            BTIPC_LOG_L2("Buffer removed from the pool at %d\n",idx);
            contextPtr->buffPool[idx].bufPtr = NULL;
            contextPtr->buffPool[idx].bufType = CY_BT_IPC_HCI_INVALID_BUF;
            status = CY_BT_IPC_DRV_SUCCESS;
            break;
        }
        else
        {
            /* This is just to keep coverity happy */
        }
    }

    Cy_SysLib_ExitCriticalSection(interruptState);

    BTIPC_LOG_L2("Remove buffer-\n");
    return status;
}

cy_en_btipcdrv_status_t Cy_bt_handle_buf_remove(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t * msgPtr)
{
    cy_stc_ipc_msg_buf_remove_t remBuf;
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    cy_en_btipcdrv_status_t status;

    BTIPC_LOG_L2("Removing buf\n");

    if ((NULL == contextPtr) || (NULL == msgPtr))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    remBuf = *(cy_stc_ipc_msg_buf_remove_t*)((void*)msgPtr);

    BTIPC_LOG_L2("bufType 0x%x\n",remBuf.bufType);
#ifdef CY_BTIPC_STATS
    if ((cy_en_btipc_buftype_t)remBuf.bufType == CY_BT_IPC_HCI_CMD_BUF)
    {
        contextPtr->ipc_hci_cmd_self_outbuf_count++;
    }
#endif
    status = Cy_bt_RemoveBuffer(contextPtr, (cy_en_btipc_buftype_t)remBuf.bufType);
    if (((uint32_t)status) != 0UL)
    {
        /* Need to check if some cleaning needed for error condition */
        BTIPC_LOG_L0("Error: 0x%x in removing the buffer from pool\n",status);
    }
    return status;
}

/* Local function implementation */
cy_en_btipcdrv_status_t Cy_bt_handle_hpclong_msg(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t * msgPtr)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    cy_stc_ipc_msg_init_t *ptr;
    cy_stc_ipc_bt_buf_t bufDescriptor;
    cy_en_btipcdrv_status_t status;
    uint8_t i;
    uint8_t bufCount;
    uint8_t *bPtr;
    uint8_t *bDptr;
    cy_en_btipc_hpcmsgid_t longMsgType;
    uint8_t idx;

