zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_ipc_bt.c
CY_IPC_SECTION_BEGIN
static uint32_t Cy_bt_getPLLegnth(cy_en_btipc_hcipti_t pti, uint8_t* bufAddr)
{
    uint32_t length;
    switch (pti)
    {
        case CY_BT_IPC_HCI_CMD:
            length = (uint32_t)(((BTHCI_CMD_HDR_t*)((void*)bufAddr))->params_len);
            length += sizeof(BTHCI_CMD_HDR_t);
            break;
        case CY_BT_IPC_HCI_ACL:
            length = (uint32_t)(((BTHCI_ACL_HDR_t*)((void*)bufAddr))->data_len);
            length += sizeof(BTHCI_ACL_HDR_t);
            break;
        case CY_BT_IPC_HCI_SCO:
            length = (uint32_t)(((BTHCI_SCO_HDR_t*)((void*)bufAddr))->data_len);
            length += sizeof(BTHCI_SCO_HDR_t);
            break;
        case CY_BT_IPC_HCI_EVT:
            length = (uint32_t)(((BTHCI_EVENT_HDR_t*)((void*)bufAddr))->params_len);
            length += sizeof(BTHCI_EVENT_HDR_t);
            break;
        case CY_BT_IPC_HCI_ISO:
            length = (uint32_t)(((BTHCI_ISO_HDR_t*)((void*)bufAddr))->data_len);
            length += sizeof(BTHCI_ISO_HDR_t);
            break;
        case CY_BT_IPC_HCI_DIAG:
            length = *bufAddr; /* The first byte of the payload holds the payload length */
            break;
        /* To be done: Header length for the remaining PTI needs to be updated */
        case CY_BT_IPC_HCI_MPAF:
            length = 0;
            break;
        case CY_BT_IPC_HCI_SLIPH5:
            length = 0;
            break;
        default:
            length = 0;
            break;
    }
    return length;
}
CY_IPC_SECTION_END

CY_IPC_SECTION_BEGIN
static bool Cy_bt_isOffsetNeeded(cy_en_btipc_hcipti_t pti)
{
    bool ret;

    switch (pti)
    {
        case CY_BT_IPC_HCI_CMD:
        case CY_BT_IPC_HCI_SCO:
            ret = true;
            break;
        case CY_BT_IPC_HCI_ACL:
        case CY_BT_IPC_HCI_EVT:
        case CY_BT_IPC_HCI_ISO:
        case CY_BT_IPC_HCI_DIAG:
        case CY_BT_IPC_HCI_MPAF:
        case CY_BT_IPC_HCI_SLIPH5:
        default:
            ret = false;
            break;
    }

    return ret;
}
CY_IPC_SECTION_END

static cy_en_btipcdrv_status_t Cy_BTIPC_HCI_FIFOPut(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t *pMsg)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint32_t interruptState;

    /* Check if buffer is full */
    if (contextPtr->IpcFifo.bufLen == ((uint8_t)MAX_IPC_FIFO_SIZE))
    {
        return CY_BT_IPC_DRV_ERROR_BUF_FULL;
    }

    interruptState = Cy_SysLib_EnterCriticalSection();

    contextPtr->IpcFifo.fifo[contextPtr->IpcFifo.wrIdx].msg[0] = pMsg[0];
    contextPtr->IpcFifo.fifo[contextPtr->IpcFifo.wrIdx].msg[1] = pMsg[1];

    contextPtr->IpcFifo.bufLen++;
    contextPtr->IpcFifo.wrIdx++;

    /* If at last index in buffer, set writeIndex back to 0 */
    if (contextPtr->IpcFifo.wrIdx == ((uint8_t)MAX_IPC_FIFO_SIZE))
    {
        contextPtr->IpcFifo.wrIdx = 0;
    }

    Cy_SysLib_ExitCriticalSection(interruptState);
    return CY_BT_IPC_DRV_SUCCESS;
}

CY_IPC_SECTION_BEGIN
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_FIFOGet(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t **ppMsg, uint8_t delete)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint32_t interruptState;

    /* Check if buffer is empty */
    if (contextPtr->IpcFifo.bufLen == 0U)
    {
        return CY_BT_IPC_DRV_ERROR_BUF_EMPTY;
    }

    interruptState = Cy_SysLib_EnterCriticalSection();
    *ppMsg = contextPtr->IpcFifo.fifo[contextPtr->IpcFifo.rdIdx].msg;

    if (delete != 0U)
    {
        contextPtr->IpcFifo.bufLen--;
        contextPtr->IpcFifo.rdIdx++;

        /* If at last index in buffer, set readIndex back to 0 */
        if (contextPtr->IpcFifo.rdIdx == ((uint8_t)MAX_IPC_FIFO_SIZE))
        {
            contextPtr->IpcFifo.rdIdx = 0;
        }
    }
    Cy_SysLib_ExitCriticalSection(interruptState);

    if ((delete != 0UL) && (((uint8_t)MAX_IPC_FIFO_SIZE - 1U) == contextPtr->IpcFifo.bufLen))
    {
        /* Release the channel as FIFO gets a free location */
        (void)Cy_BTIPC_HCI_RelChannel(contextPtr); /* Suppress a compiler warning about unused return value */
#ifdef CY_BTIPC_STATS
        contextPtr->ipc_hci_peer_release_count++;
#endif
        BTIPC_LOG_L0("Releasing the channel\n");
    }
    return CY_BT_IPC_DRV_SUCCESS;
}
CY_IPC_SECTION_END

CY_IPC_SECTION_BEGIN
uint16_t Cy_BTIPC_HCI_FIFOCount(cy_stc_ipc_bt_context_t *btIpcContext)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint32_t interruptState;
    uint16_t count;

    interruptState = Cy_SysLib_EnterCriticalSection();
    count = contextPtr->IpcFifo.bufLen;
    Cy_SysLib_ExitCriticalSection(interruptState);
    return count;
}
CY_IPC_SECTION_END

cy_en_btipcdrv_status_t Cy_BTIPC_RetrieveContext(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_bt_save_ctxt_t *pContextRet)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint32_t i;

    if ((NULL == contextPtr) || (NULL == pContextRet))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    for (i = 0U; i < ((uint8_t)MAX_BUF_COUNT); i++)
    {
        pContextRet->buffPool[i].bufType = (uint16_t) contextPtr->buffPool[i].bufType;
        pContextRet->buffPool[i].bufLen = contextPtr->buffPool[i].bufLen;
        pContextRet->buffPool[i].bufPtr = contextPtr->buffPool[i].bufPtr;
    }
    return CY_BT_IPC_DRV_SUCCESS;
}

cy_en_btipcdrv_status_t Cy_BTIPC_RestoreContext(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_bt_save_ctxt_t *pContextRet)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint32_t i;
    if ((NULL == contextPtr) || (NULL == pContextRet))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    for (i = 0U; i < ((uint8_t)MAX_BUF_COUNT); i++)
    {
        contextPtr->buffPool[i].bufType = (cy_en_btipc_buftype_t) pContextRet->buffPool[i].bufType;
        contextPtr->buffPool[i].bufLen = pContextRet->buffPool[i].bufLen;
        contextPtr->buffPool[i].bufPtr = pContextRet->buffPool[i].bufPtr;
    }
    return CY_BT_IPC_DRV_SUCCESS;
}

#ifdef BTIPC_STATUS
cy_en_btipcdrv_status_t Cy_bt_PrintStatus (cy_stc_ipc_bt_context_t *btIpcContext)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint8_t idx;
    uint32_t interruptState;

    if (NULL == contextPtr)
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

