zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_ipc_bt.c
    interruptState = Cy_SysLib_EnterCriticalSection();

    printf("\n\nBuf Pool content\n");
    for (idx = 0U; idx < ((uint8_t)MAX_BUF_COUNT); idx++)
    {
#if defined (__ARMCC_VERSION)
        printf("idx %d, bufType 0x%x, bufLen %d, bufPtr 0x%x\n",idx, contextPtr->buffPool[idx].bufType,contextPtr->buffPool[idx].bufLen, (uint32_t)(contextPtr->buffPool[idx].bufPtr));
#else
    printf("idx %d, bufType 0x%x, bufLen %d, bufPtr %p\n",idx, contextPtr->buffPool[idx].bufType,contextPtr->buffPool[idx].bufLen, contextPtr->buffPool[idx].bufPtr);
#endif
    }

    printf("\nFIFO content\n");
    for (idx = 0; idx < MAX_IPC_FIFO_SIZE; idx++)
    {
#if defined (__ARMCC_VERSION)
        printf("idx %d, msg[0] 0x%x, msg[1] 0x%x\n",idx, contextPtr->IpcFifo.fifo[idx].msg[0], contextPtr->IpcFifo.fifo[idx].msg[1]);
#else
        printf("idx %d, msg[0] 0x%lx, msg[1] 0x%lx\n",idx, contextPtr->IpcFifo.fifo[idx].msg[0], contextPtr->IpcFifo.fifo[idx].msg[1]);
#endif
    }
    printf("rdIdx %d, wrIdx %d, bufLen %d\n",contextPtr->IpcFifo.rdIdx, contextPtr->IpcFifo.wrIdx, contextPtr->IpcFifo.bufLen);

    printf("\nCallbacks registered\n");
    for (idx = 0; idx < MAX_BT_IPC_HPC_CB; idx++)
    {
#if defined (__ARMCC_VERSION)
        printf("idx %d, hpcNotifyCallbackPtr 0x%x, msgType %d\n", idx,
                (uint32_t)(contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr),
                contextPtr->hpcNotifyCallbackParam[idx].msgType);
#else
    printf("idx %d, hpcNotifyCallbackPtr %p, msgType %d\n", idx,
            contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr,
            contextPtr->hpcNotifyCallbackParam[idx].msgType);
#endif
    }

    Cy_SysLib_ExitCriticalSection(interruptState);
    return CY_BT_IPC_DRV_SUCCESS;
}
#endif
CY_MISRA_BLOCK_END('ARRAY_VS_SINGLETON')
#endif
